'use strict';

module.exports = {
	10001: '初始化错误',
	50: 'CGI系统错误,请刷新页面重试',
	51: 'vid个数超出范围',
	52: '访问视频付费信息失败，请刷新页面重试',
	64: '校验视频付费信息失败，请刷新页面重试',
	61: '您请求的视频已下架',
	62: '视频状态不合法',
	63: '清晰度格式不合法',
	65: '速度格式不合法',
	66: '视频格式不存在',
	68: 'CGI系统错误,请刷新页面重试',
	69: 'format列表为空',
	71: '未找到HLS CDN',
	73: '生成文件名失败',
	74: '分片号不合法',
	76: '获取m3u8文件名失败',
	77: '生成HLS key失败',
	80: '因版权限制,请到腾讯视频观看',
	81: 'referer限制',
	82: 'qzone权限限制',
	83: '该片为付费视频,VIP会员免费观看',
	84: '访问IP是黑名单',
	86: 'CGI访问频率限制',
	444: 'CGI系统错误,请刷新页面重试',
	'defaultMsg': '加载失败，请重试'
};